{
    "exames" :[
        {
            "id_exame": 1,
            "nome_exame": "aws cloud pratitioner",
            "lista_topico": [
                "Kendra",
                "Inspector",
                "Snowmobile",
                "Artifact"
            ]

        },
        {
            "id_exame": 2,
            "nome_exame": "concurso cebraspe",
            "lista_topico": [
                "Lei n.º 8.112/1990 - Regime Jurídico dos Servidores Públicos",
                "Lei n.º 9.784/1999 - Processo Administrativo Federal",
                "Constituição Federal - Princípios Fundamentais, Direitos e Garantias, Administração Pública, Educação, Cultura, Desporto, Ciência, Tecnologia e Inovação",
                "Código Civil - Pessoas Naturais, Pessoas Jurídicas, Responsabilidade Civil",
                "Código Penal - Crimes contra a Administração Pública",
                "Banco de dados relacional: Modelo de dados relacional: conceitos,",
                "Banco de dados relacional:álgebra de relações,",
                "Banco de dados relacional:dependência funcional e formas normais,",
                "Sistema Gerenciador de Banco de Dados Relacional (SGBDR): arquitetura,",
                "Sistema Gerenciador de Banco de Dados Relacional (SGBDR)segurança,",
                "Sistema Gerenciador de Banco de Dados Relacional (SGBDR)integridade,",
                "Sistema Gerenciador de Banco de Dados Relacional (SGBDR)concorrência e gerenciamento de transações,",
                "Consultas sobre Banco de Dados relacionais utilizando comandos SQL (Structure Query Language) padrão ANSI 92,",
                "Linguagem de Definição e Manipulação de Dados (SQL DDL e SQL DML).",
                "Modelagem de Dados e Projeto de Banco de Dados: Modelo Entidade-Relacionamento,",
                "Projeto lógico e físico de Banco de Dados,",
                "Normalização do modelo de banco de dados.",
                "Desenvolvimento de software: Levantamento de requisitos,",
                "Metodologias de Análise e Projeto de software,",
                "Conceitos de gerência de projetos de software. Análise de algoritmos. Desenvolvimento Orientado a Objetos. Design Patterns. Servidores Web de Aplicação.",
                "Engenharia de Software: Metodologias e modelos de desenvolvimento de software,",
                "Modelagem de software usando UML (Unified Modelling Language),",
                "Processo de software: conceitos,",
                "Processo de software:artefatos e atividades,",
                "Processo Unificado (RUP),",
                "Teste de software,",
                "Métricas de software,",
                "Qualidade de software. CMMI.",
                "Programação de computadores: Lógica de programação,",
                "Codificação e teste de programas,",
                "Linguagens: PHP,",
                "Java para Web,",
                "XHTML e HTML5,",
                "CSS,",
                "XML.",
                "Fundamentos de computação: Organização e arquitetura de computadores.",
                "Componentes de um computador (hardware e software).",
                "Princípios de sistemas operacionais.",
                "Arquitetura e organização de computadores.",
                "Redes de computadores: Conceitos,",
                "tipos e abrangência,",
                "Topologia lógica e física,",
                "Tecnologias e ferramentas relacionadas às redes de computadores,",
                "Protocolos de rede: IP (formato,mecânica,endereçamento) para ARP,ICMP,TCP,UDP",
                "Segurança da informação: Segurança física e lógica, Firewall e Proxy e Criptografia.",
                "Gerência de projetos: Conceitos básicos;",
                "Processos do PMBOK.",
                "Gerenciamento da integração, do escopo, do tempo, de custos, de recursos humanos, de riscos, das comunicações, da qualidade e de aquisições.",
                "Segurança da informação: Conceitos básicos. Políticas de segurança. ",
                "Classificação de informações. ",
                "Análise de vulnerabilidade. ",
                "Plano de continuidade de negócio. ",
                "Tratamento de Incidentes. ",
                "Normas ISO 27001 e ISO 27002. ",
                "Auditoria e conformidade.",
                "11. Governança e Gestão de TI: Fundamentos do ITIL® (v3): aspectos gerais, estrutura, conceitos, finalidade, suporte a serviços, entrega de serviços. ",
                "Fundamentos de COBIT (versão 5): aspectos gerais, estrutura, conceitos, finalidade, modelos de maturidade, objetivos de controle, objetivos de negócios e objetivos de TI, domínios e processos. ",
                "Boas Práticas Governança de TIC de governo: Guia de Governança de TIC do SISP (v 2.0).",
                "Arquitetura e tecnologias de sistemas de informação: Conceitos básicos. ",
                "Workflow e gerenciamento eletrônico de documentos. ",
                "Arquitetura cliente‐ servidor. ",
                "Arquitetura orientada a serviço. ",
                "Arquitetura distribuída. ",
                "Arquitetura de grande porte. ",
                "Data Mining. ",
                "Data Warehouse. ",
                "Business Intelligence. ",
                "Portais corporativos: usabilidade e acessibilidade na internet, padrões W3C e e‐MAG",
                "JavaScript e toolkits jQuery",
                "CSS3",
                "HTML5",
                "XML",
                "XLST",
                "JSON",
                "Sistemas colaborativos.",
                "Gestão de conteúdo: ferramentas, principais características, componentes, arquitetura, instalação e configuração de sítios web – WordPress. ",
                "Especificação de metadados e web services. ",
                "Computação em GRID, conceitos de computação em cluster, conceitos de computação em nuvem. ",
                "Conceitos de aplicação em dispositivos móveis.",
                "Gestão de processos de negócio: Gerenciamento de processos. ",
                "Cadeia de valor do negócio. ",
                "Modelagem de processos com BPMN (versão 2.0). ",
                "Técnicas de análise de processos. ",
                "Melhoria de processos. ",
                "Integração de processos.",
                "Gestão estratégica: Noções e metodologias de planejamento estratégico. ",
                "Balanced Scorecard (BSC). ",
                "Planejamento Estratégico Situacional (PES), Matriz SWOT. ",
                "Análise de cenários. ",
                "Metodologias para medição de desempenho. ",
                "Indicadores de desempenho: conceito, formulação e análise.",
                "Banco de dados: Conceitos básicos. ",
                "Abordagem relacional. ",
                "Modelo entidade‐relacionamento. ",
                "Normalização. ",
                "Sistemas gerenciadores de banco de dados (SGBD). ",
                "Modelagem multidimensional. ",
                "Bancos de dados multidimensionais. ",
                "Linguagens de definição e manipulação de dados. ",
                "Linguagem SQL (Structured Query Language). ",
                "Big Data.",
                "Tecnologia da Informação na Administração Pública: Planejamento Plurianual (PPA). ",
                "Planejamento de TI: estratégico e tático.",
                "Contratações de TI na Administração Pública Federal: Instrução Normativa para Contratação de Soluções de Tecnologia da Informação – Instrução Normativa nº 01, de 4 de abril de 2019",
                "Lei nº 8.666, de 21 de junho de 1993.",
                "Infraestrutura de TI: Modelo OSI.",
                "Cabeamento estruturado e rede sem fio (wireless).",
                "Switches, roteadores e firewalls.",
                "NAT, QoS, Vlan, STP, 802.1x.",
                "Redes de transmissão de dados (LAN/MAN/WAN).",
                "Arquitetura e protocolos IP, TCP, UDP, DHCP, DNS, IPSEC, SNMP, LDAP, CIFS, NFS, SSH, IMAP, SMTP, HTTP, HTTPS e FTP.",
                "Roteamento de redes.",
                "PROXY.",
                "Operação, administração, análise de performance e tunning de Sistemas Operacionais Windows (8, 10 e server 2016) e GNU/Linux Server (Ubuntu).",
                "Operação e administração de servidores web e aplicação (APACHE, NGINX, PHP, JBOSS e IIS).",
                "Operação e administração do Microsoft Active Directory e Servidores de Correio (Exchange).",
                "Ferramentas de infraestrutura ágil, automatização e gerenciamento de configuração (Puppet, Jenkins, GIT).",
                "Conceitos de DEVOPS.",
                "Softwares livres de inventário, monitoramento e diagnóstico de ambientes computacionais.",
                "Equipamentos de conexão e transmissão de áudio e vídeo (VoIP, SIP).",
                "Virtualização.",
                "Conceitos de clusterização, alta disponibilidade e escalabilidade.",
                "Arquiteturas e protocolos para redes de armazenamento de dados (SAN).",
                "Conceitos e ferramentas de backup e restore de dados.",
                "Sistemas de detecção de intrusão.",
                "Vulnerabilidades e ataques a sistemas computacionais.",
                "Proteções relativas a hardware e software.",
                "Conceitos de Antivírus, Anti-Malware e AntiSpam.",
                "Criptografia, protocolos criptográficos, sistemas de criptografia e aplicações.",
                "Certificados Digitais para pessoas físicas, jurídicas e servidores de rede (e‐CPF, e‐CNPJ, SSL, EV SSL, SAN e WILDCARD).",
                "Adição do tópico Conteinerização e Orquestração de contêineres"

            ]
        }

    ]
    
}